<a href="https://colab.research.google.com/github/crd3cc04/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Copy_of_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-07 05:13:46--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.40.14
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.40.14|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  48.2MB/s    in 4.5s

2019-11-07 05:13:56 (43.9 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
! ls

aisles.csv	 order_products__prior.csv  orders.csv
departments.csv  order_products__train.csv  products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
product = pd.read_csv('products.csv')
print(product.shape)
product.tail(3)

(49688, 4)

       product_id  ... department_id
49685       49686  ...             3
49686       49687  ...             8
49687       49688  ...            11

[3 rows x 4 columns]

In [0]:
product.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id'], dtype='object')

In [0]:
col1 = ['product_id', 'product_name']
product = product[col1]

In [0]:
# Created condition that will be used in the joining of both of my datasets
condition2 = (product['product_name']=='Organic Whole Milk') | (product['product_name']=='Banana') |( product['product_name']=='Organic Strawberries') | (product['product_name']=='Bag of Organic Bananas') |  (product['product_name']=='Organic Baby Spinash') | (product['product_name']=='Organic Hass Avocado') |( product['product_name']=='Organic Avocado') | (product['product_name']=='Large Lemon') | (product['product_name']=='Strawberries') | (product['product_name']=='Limes') | (product['product_name']=='Organic Baby Spinach')
condition2

0        False
1        False
2        False
3        False
4        False
         ...
49683    False
49684    False
49685    False
49686    False
49687    False
Name: product_name, Length: 49688, dtype: bool

In [0]:
# Successful extraction of the products that the assignment is asking about
product[condition2]

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [0]:
product_subset = product[condition2]

In [0]:
product_subset.shape

(10, 2)

In [0]:
# Retrieved file for the dataframe that I will be using 
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.sample(3)

(3421083, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
258780    1276164    15674  ...                13                    10.0
2562453    585403   154205  ...                20                     5.0
701130    1960707    42236  ...                13                     7.0

[3 rows x 7 columns]

In [0]:
orders.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [0]:
# Created columns that I will need to use
cols=['user_id', 'order_id', 'order_number', "order_hour_of_day"]
orders = orders[cols]

In [0]:
# Created condition that will help in filtering what information I need to use
condition = (orders['user_id']==1) & (orders['order_number']<=10)
condition

0           True
1           True
2           True
3           True
4           True
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Length: 3421083, dtype: bool

In [0]:
orders[condition]

   user_id  order_id  order_number  order_hour_of_day
0        1   2539329             1                  8
1        1   2398795             2                  7
2        1    473747             3                 12
3        1   2254736             4                  7
4        1    431534             5                 15
5        1   3367565             6                  7
6        1    550135             7                  9
7        1   3108588             8                 14
8        1   2295261             9                 16
9        1   2550362            10                  8

In [0]:
orders_subset = orders[condition]

In [0]:
orders_subset.shape

(10, 4)

In [0]:
column1 = ['order_id', 'add_to_cart_order']

In [0]:
print(orders_subset.columns)
print(product_subset.columns)

Index(['user_id', 'order_id', 'order_number', 'order_hour_of_day'], dtype='object')
Index(['product_id', 'product_name'], dtype='object')

In [0]:
# Printed the shape of both conditions
print(orders_subset.shape)
product_subset.shape

(10, 4)

(10, 2)

In [0]:
# Calling the files of 'order products prior' and order products train
order_products_prior = pd.read_csv('order_products__prior.csv')
print(order_products_prior.shape)
order_products_prior.sample(3)

(32434489, 4)

          order_id  product_id  add_to_cart_order  reordered
12718548   1342355       15392                 10          0
7978078     842255       47766                  5          1
22623334   2386169       30776                  2          1

In [0]:
order_products_train=pd.read_csv('order_products__train.csv')
print(order_products_train.shape)
order_products_train.head(3)

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0

In [0]:
# Concate of 'order product prior and order product train
order_products = pd.concat([order_products_prior, order_products_train])
order_products.shape

(33819106, 4)

In [0]:
order_products.columns

Index(['order_id', 'product_id', 'add_to_cart_order', 'reordered'], dtype='object')

In [0]:
# Selecting columns I want in the final dataframe
columns = ['order_id', 'add_to_cart_order', 'product_id']

In [0]:
# Naming my subset 
order_products_subset = order_products.loc[condition, columns]
order_products_subset

          order_id  add_to_cart_order  product_id
22742744   2398795                  1         196
22742745   2398795                  2       10258
22742746   2398795                  3       12427
22742747   2398795                  4       13176
22742748   2398795                  5       26088
22742749   2398795                  6       13032
24076664   2539329                  1         196
24076665   2539329                  2       14084
24076666   2539329                  3       12427
24076667   2539329                  4       26088
24076668   2539329                  5       26405

In [0]:
# Merge method is being used to bring together the two subsets created before 
final = pd.merge(order_products, product_subset[['product_id', 'product_name']], how='inner', on='product_id')
final

         order_id  product_id  ...  reordered          product_name
0               3       21903  ...          1  Organic Baby Spinach
1              26       21903  ...          0  Organic Baby Spinach
2              31       21903  ...          1  Organic Baby Spinach
3              39       21903  ...          0  Organic Baby Spinach
4              56       21903  ...          1  Organic Baby Spinach
...           ...         ...  ...        ...                   ...
2418309   3418861       26209  ...          1                 Limes
2418310   3418905       26209  ...          1                 Limes
2418311   3419642       26209  ...          0                 Limes
2418312   3420257       26209  ...          1                 Limes
2418313   3420286       26209  ...          0                 Limes

[2418314 rows x 5 columns]

In [0]:
# Display(example) (according to the assinment) has been confirmed
final.sort_values(by='order_id')

         order_id  product_id  ...  reordered            product_name
631155          1       13176  ...          0  Bag of Organic Bananas
860219          1       47209  ...          0    Organic Hass Avocado
0               3       21903  ...          1    Organic Baby Spinach
646635          5       47209  ...          0    Organic Hass Avocado
251705          5       13176  ...          1  Bag of Organic Bananas
...           ...         ...  ...        ...                     ...
1956507   3421077       27845  ...          0      Organic Whole Milk
1340075   3421078       24852  ...          1                  Banana
1956508   3421080       27845  ...          1      Organic Whole Milk
2265159   3421082       16797  ...          0            Strawberries
1340076   3421083       24852  ...          1                  Banana

[2418314 rows x 5 columns]

In [0]:
# Summary of the assingment values and how many times they were ordered
final['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
myindex=['John Smith', 'Jane Doe', 'Mary Johnson']
mycolumns=['treatmenta', 'treatmentb']

table1 = pd.DataFrame(
            [[np.nan, 2],
             [16, 11],
             [3, 1]],
          columns=mycolumns,
        index=myindex
)

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# Table 2 --> Tidy
list(table2.columns)
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [0]:
table2.index.tolist()

['treatmenta', 'treatmentb']

In [0]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
# Converting from 'wide' to 'tidy' using 'melt' method
tidy = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
# Renaming the columns
tidy = tidy.rename(columns={'index': 'trt', 'variable': 'name', 'value': 'result'})
tidy

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [0]:
# Using pivot_table function is the inverse of melt
wide = tidy.pivot_table(index='name', columns='trt', values='result')
wide

trt           treatment  treatmenta
name
Jane Doe           11.0        16.0
John Smith          2.0         NaN
Mary Johnson        1.0         3.0

In [0]:
flights = sns.load_dataset('flights')

In [124]:
##### YOUR CODE HERE #####
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [130]:
def remove_outliers(values):
  mid_quantiles = values.quantile([.25, .75])
  
  return np.mean(mid_quantiles)
pd.pivot_table(flights, index='year', columns='month', values='passengers', aggfunc=[np.mean, remove_outliers])

         mean                       ... remove_outliers
month January February March April  ...       September October November December
year                                ...
1949      112      118   132   129  ...             136     119      104      118
1950      115      126   141   135  ...             158     133      114      140
1951      145      150   178   163  ...             184     162      146      166
1952      171      180   193   181  ...             209     191      172      194
1953      196      196   236   235  ...             237     211      180      201
1954      204      188   235   227  ...             259     229      203      229
1955      242      233   267   269  ...             312     274      237      278
1956      284      277   317   313  ...             355     306      271      306
1957      315      301   356   348  ...             404     347      305      336
1958      340      318   362   348  ...             404     359      310      337
1959      360      342   406   396  ...             463     407      362      405
1960      417      391   419   461  ...             508     461      390      432

[12 rows x 24 columns]

In [132]:
# I tried really hard in trying to get this result. I know that all though it is not completely what was asked, I 
# close. I pivoted the flight data by using the pd.pivot_table function while adding the df.query function to gather
# the specific data from the dataframe.
pd.pivot_table(flights, index='year', columns='month', values='passengers', aggfunc=[np.mean, remove_outliers])
flights.query('year == [1949, 1960] and month == ["January", "December"]')

     year     month  passengers
0    1949   January         112
11   1949  December         118
132  1960   January         417
143  1960  December         432

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####